{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/allenprimack/Downloads/The effect of the rise of baseball analytics on MLB Free Agency and Player Valuation Stata Analysis Do File.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 May 2021, 21:43:40

{com}. import excel "/Users/allenprimack/Downloads/MLBFreeAgentData.xlsx", sheet("Sheet1") firstrow clear
{res}{text}(37 vars, 884 obs)

{com}. *Model with all variables included

. regress Guarantee Year Age Years HR RBI IBB SB AVG BB K BBK OBP SLG ISO BABIP wOBA wRAA wRC RAR WPA RE24 REW

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       884
{txt}{hline 13}{c +}{hline 34}   F(22, 861)      = {res}   194.37
{txt}       Model {c |} {res} 4.1969e+17        22  1.9077e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8.4506e+16       861  9.8148e+13   {txt}R-squared       ={res}    0.8324
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8281
{txt}       Total {c |} {res} 5.0420e+17       883  5.7100e+14   {txt}Root MSE        =   {res} 9.9e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 487330.9{col 26}{space 2}  73088.2{col 37}{space 1}    6.67{col 46}{space 3}0.000{col 54}{space 4} 343879.1{col 67}{space 3} 630782.8
{txt}{space 9}Age {c |}{col 14}{res}{space 2}-65408.83{col 26}{space 2} 125302.2{col 37}{space 1}   -0.52{col 46}{space 3}0.602{col 54}{space 4}-311342.3{col 67}{space 3} 180524.7
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.40e+07{col 26}{space 2} 389526.4{col 37}{space 1}   36.06{col 46}{space 3}0.000{col 54}{space 4} 1.33e+07{col 67}{space 3} 1.48e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2}   199219{col 26}{space 2} 88774.12{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} 24979.95{col 67}{space 3}   373458
{txt}{space 9}RBI {c |}{col 14}{res}{space 2} 95224.76{col 26}{space 2} 32111.56{col 37}{space 1}    2.97{col 46}{space 3}0.003{col 54}{space 4} 32198.65{col 67}{space 3} 158250.9
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 135849.1{col 26}{space 2}  96361.1{col 37}{space 1}    1.41{col 46}{space 3}0.159{col 54}{space 4}-53281.01{col 67}{space 3} 324979.3
{txt}{space 10}SB {c |}{col 14}{res}{space 2} 93818.02{col 26}{space 2}  28208.7{col 37}{space 1}    3.33{col 46}{space 3}0.001{col 54}{space 4} 38452.16{col 67}{space 3} 149183.9
{txt}{space 9}AVG {c |}{col 14}{res}{space 2}-2.51e+08{col 26}{space 2} 6.69e+08{col 37}{space 1}   -0.37{col 46}{space 3}0.708{col 54}{space 4}-1.56e+09{col 67}{space 3} 1.06e+09
{txt}{space 10}BB {c |}{col 14}{res}{space 2}-1.45e+07{col 26}{space 2} 5.23e+07{col 37}{space 1}   -0.28{col 46}{space 3}0.781{col 54}{space 4}-1.17e+08{col 67}{space 3} 8.81e+07
{txt}{space 11}K {c |}{col 14}{res}{space 2}-3.24e+07{col 26}{space 2} 3.37e+07{col 37}{space 1}   -0.96{col 46}{space 3}0.337{col 54}{space 4}-9.86e+07{col 67}{space 3} 3.38e+07
{txt}{space 9}BBK {c |}{col 14}{res}{space 2} -3325082{col 26}{space 2}  3294397{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4} -9791071{col 67}{space 3}  3140906
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 3.20e+07{col 26}{space 2} 1.12e+08{col 37}{space 1}    0.29{col 46}{space 3}0.776{col 54}{space 4}-1.88e+08{col 67}{space 3} 2.52e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2} 1.41e+08{col 26}{space 2} 6.69e+08{col 37}{space 1}    0.21{col 46}{space 3}0.833{col 54}{space 4}-1.17e+09{col 67}{space 3} 1.45e+09
{txt}{space 9}ISO {c |}{col 14}{res}{space 2}-2.06e+08{col 26}{space 2} 6.71e+08{col 37}{space 1}   -0.31{col 46}{space 3}0.759{col 54}{space 4}-1.52e+09{col 67}{space 3} 1.11e+09
{txt}{space 7}BABIP {c |}{col 14}{res}{space 2} 2.25e+07{col 26}{space 2} 7.41e+07{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-1.23e+08{col 67}{space 3} 1.68e+08
{txt}{space 8}wOBA {c |}{col 14}{res}{space 2} 2.63e+07{col 26}{space 2} 1.57e+08{col 37}{space 1}    0.17{col 46}{space 3}0.867{col 54}{space 4}-2.82e+08{col 67}{space 3} 3.34e+08
{txt}{space 8}wRAA {c |}{col 14}{res}{space 2} 230583.8{col 26}{space 2} 63496.12{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} 105958.5{col 67}{space 3} 355209.1
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-157005.2{col 26}{space 2} 33293.11{col 37}{space 1}   -4.72{col 46}{space 3}0.000{col 54}{space 4}-222350.4{col 67}{space 3}-91660.07
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 61999.87{col 26}{space 2}  22495.3{col 37}{space 1}    2.76{col 46}{space 3}0.006{col 54}{space 4} 17847.83{col 67}{space 3} 106151.9
{txt}{space 9}WPA {c |}{col 14}{res}{space 2}-716422.4{col 26}{space 2} 346545.9{col 37}{space 1}   -2.07{col 46}{space 3}0.039{col 54}{space 4} -1396596{col 67}{space 3}-36248.78
{txt}{space 8}RE24 {c |}{col 14}{res}{space 2} 163947.5{col 26}{space 2} 237025.4{col 37}{space 1}    0.69{col 46}{space 3}0.489{col 54}{space 4}-301267.8{col 67}{space 3} 629162.8
{txt}{space 9}REW {c |}{col 14}{res}{space 2}-615541.3{col 26}{space 2}  2291825{col 37}{space 1}   -0.27{col 46}{space 3}0.788{col 54}{space 4} -5113760{col 67}{space 3}  3882677
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-9.71e+08{col 26}{space 2} 1.51e+08{col 37}{space 1}   -6.43{col 46}{space 3}0.000{col 54}{space 4}-1.27e+09{col 67}{space 3}-6.74e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. *Test for multicollinearity

. vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 9}SLG {c |} {res} 16996.66    0.000059
{txt}{space 9}ISO {c |} {res} 12638.89    0.000079
{txt}{space 9}AVG {c |} {res}  3033.10    0.000330
{txt}{space 8}RE24 {c |} {res}   385.41    0.002595
{txt}{space 9}REW {c |} {res}   353.76    0.002827
{txt}{space 8}wOBA {c |} {res}   255.09    0.003920
{txt}{space 9}OBP {c |} {res}   113.89    0.008780
{txt}{space 7}BABIP {c |} {res}    41.44    0.024132
{txt}{space 11}K {c |} {res}    34.31    0.029146
{txt}{space 9}wRC {c |} {res}    27.86    0.035898
{txt}{space 10}BB {c |} {res}    24.18    0.041360
{txt}{space 9}RBI {c |} {res}    23.96    0.041734
{txt}{space 10}HR {c |} {res}    23.51    0.042536
{txt}{space 8}wRAA {c |} {res}    21.98    0.045502
{txt}{space 9}WPA {c |} {res}     7.56    0.132302
{txt}{space 9}BBK {c |} {res}     6.79    0.147339
{txt}{space 9}RAR {c |} {res}     3.94    0.253845
{txt}{space 9}IBB {c |} {res}     3.20    0.312940
{txt}{space 7}Years {c |} {res}     2.18    0.458034
{txt}{space 10}SB {c |} {res}     2.10    0.475968
{txt}{space 8}Year {c |} {res}     1.54    0.649393
{txt}{space 9}Age {c |} {res}     1.32    0.759882
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}  1545.57

{com}. *Removing variable showing severe multicollinearity and statistically insignificant variables 

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       884
{txt}{hline 13}{c +}{hline 34}   F(9, 874)       = {res}   447.21
{txt}       Model {c |} {res} 4.1424e+17         9  4.6027e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 8.9952e+16       874  1.0292e+14   {txt}R-squared       ={res}    0.8216
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8198
{txt}       Total {c |} {res} 5.0420e+17       883  5.7100e+14   {txt}Root MSE        =   {res} 1.0e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 541502.6{col 26}{space 2} 64410.98{col 37}{space 1}    8.41{col 46}{space 3}0.000{col 54}{space 4} 415084.4{col 67}{space 3} 667920.9
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.48e+07{col 26}{space 2}   356233{col 37}{space 1}   41.57{col 46}{space 3}0.000{col 54}{space 4} 1.41e+07{col 67}{space 3} 1.55e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 224194.5{col 26}{space 2} 51069.08{col 37}{space 1}    4.39{col 46}{space 3}0.000{col 54}{space 4} 123962.2{col 67}{space 3} 324426.9
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 145667.4{col 26}{space 2} 71783.49{col 37}{space 1}    2.03{col 46}{space 3}0.043{col 54}{space 4} 4779.237{col 67}{space 3} 286555.6
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 3.91e+07{col 26}{space 2} 2.11e+07{col 37}{space 1}    1.85{col 46}{space 3}0.064{col 54}{space 4} -2355686{col 67}{space 3} 8.06e+07
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-2.17e+07{col 26}{space 2} 1.15e+07{col 37}{space 1}   -1.89{col 46}{space 3}0.059{col 54}{space 4}-4.42e+07{col 67}{space 3} 798945.4
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-42973.51{col 26}{space 2} 16046.76{col 37}{space 1}   -2.68{col 46}{space 3}0.008{col 54}{space 4} -74468.2{col 67}{space 3}-11478.82
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 77007.21{col 26}{space 2} 21674.68{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} 34466.72{col 67}{space 3} 119547.7
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 490660.4{col 26}{space 2} 229132.8{col 37}{space 1}    2.14{col 46}{space 3}0.033{col 54}{space 4} 40945.53{col 67}{space 3} 940375.3
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.11e+09{col 26}{space 2} 1.31e+08{col 37}{space 1}   -8.45{col 46}{space 3}0.000{col 54}{space 4}-1.37e+09{col 67}{space 3}-8.52e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. *Model for years 1999-2006       

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 1998 & Year < 2007

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       336
{txt}{hline 13}{c +}{hline 34}   F(9, 326)       = {res}   149.15
{txt}       Model {c |} {res} 1.5020e+17         9  1.6689e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.6478e+16       326  1.1190e+14   {txt}R-squared       ={res}    0.8046
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7992
{txt}       Total {c |} {res} 1.8668e+17       335  5.5725e+14   {txt}Root MSE        =   {res} 1.1e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 549626.6{col 26}{space 2} 247753.8{col 37}{space 1}    2.22{col 46}{space 3}0.027{col 54}{space 4} 62228.69{col 67}{space 3}  1037025
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.25e+07{col 26}{space 2} 560536.3{col 37}{space 1}   22.38{col 46}{space 3}0.000{col 54}{space 4} 1.14e+07{col 67}{space 3} 1.36e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2}   284182{col 26}{space 2} 88113.07{col 37}{space 1}    3.23{col 46}{space 3}0.001{col 54}{space 4}   110840{col 67}{space 3} 457523.9
{txt}{space 9}IBB {c |}{col 14}{res}{space 2}-72780.79{col 26}{space 2} 114126.8{col 37}{space 1}   -0.64{col 46}{space 3}0.524{col 54}{space 4}-297298.8{col 67}{space 3} 151737.2
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 8.91e+07{col 26}{space 2} 3.46e+07{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} 2.11e+07{col 67}{space 3} 1.57e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-2.24e+07{col 26}{space 2} 1.99e+07{col 37}{space 1}   -1.13{col 46}{space 3}0.261{col 54}{space 4}-6.16e+07{col 67}{space 3} 1.68e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-69607.79{col 26}{space 2} 26811.47{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-122353.1{col 67}{space 3}-16862.46
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 83144.78{col 26}{space 2} 36717.49{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} 10911.66{col 67}{space 3} 155377.9
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 335468.9{col 26}{space 2} 375907.5{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-404041.8{col 67}{space 3}  1074980
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.14e+09{col 26}{space 2} 4.98e+08{col 37}{space 1}   -2.28{col 46}{space 3}0.023{col 54}{space 4}-2.12e+09{col 67}{space 3}-1.57e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model1

. *Model for years 2000-2007

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 1999 & Year < 2008

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       335
{txt}{hline 13}{c +}{hline 34}   F(9, 325)       = {res}   160.94
{txt}       Model {c |} {res} 1.6430e+17         9  1.8256e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.6867e+16       325  1.1344e+14   {txt}R-squared       ={res}    0.8167
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8117
{txt}       Total {c |} {res} 2.0117e+17       334  6.0231e+14   {txt}Root MSE        =   {res} 1.1e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 540424.3{col 26}{space 2} 274204.7{col 37}{space 1}    1.97{col 46}{space 3}0.050{col 54}{space 4}  984.094{col 67}{space 3}  1079864
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.36e+07{col 26}{space 2} 549609.5{col 37}{space 1}   24.75{col 46}{space 3}0.000{col 54}{space 4} 1.25e+07{col 67}{space 3} 1.47e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 337855.2{col 26}{space 2} 92818.37{col 37}{space 1}    3.64{col 46}{space 3}0.000{col 54}{space 4} 155254.5{col 67}{space 3} 520455.8
{txt}{space 9}IBB {c |}{col 14}{res}{space 2}-44880.78{col 26}{space 2} 111719.8{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}  -264666{col 67}{space 3} 174904.5
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 7.67e+07{col 26}{space 2} 3.69e+07{col 37}{space 1}    2.08{col 46}{space 3}0.039{col 54}{space 4}  3990374{col 67}{space 3} 1.49e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-2.93e+07{col 26}{space 2} 2.12e+07{col 37}{space 1}   -1.39{col 46}{space 3}0.167{col 54}{space 4}-7.10e+07{col 67}{space 3} 1.23e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-71660.47{col 26}{space 2} 27735.69{col 37}{space 1}   -2.58{col 46}{space 3}0.010{col 54}{space 4}-126224.6{col 67}{space 3}-17096.33
{txt}{space 9}RAR {c |}{col 14}{res}{space 2}  60319.3{col 26}{space 2} 37685.89{col 37}{space 1}    1.60{col 46}{space 3}0.110{col 54}{space 4}-13819.78{col 67}{space 3} 134458.4
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 425960.8{col 26}{space 2} 394585.1{col 37}{space 1}    1.08{col 46}{space 3}0.281{col 54}{space 4}-350302.6{col 67}{space 3}  1202224
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.11e+09{col 26}{space 2} 5.51e+08{col 37}{space 1}   -2.02{col 46}{space 3}0.044{col 54}{space 4}-2.20e+09{col 67}{space 3}-2.83e+07
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model2

. *Model for years 2001-2008

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2000 & Year < 2009

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       357
{txt}{hline 13}{c +}{hline 34}   F(9, 347)       = {res}   175.99
{txt}       Model {c |} {res} 2.3259e+17         9  2.5843e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5.0956e+16       347  1.4685e+14   {txt}R-squared       ={res}    0.8203
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8156
{txt}       Total {c |} {res} 2.8354e+17       356  7.9646e+14   {txt}Root MSE        =   {res} 1.2e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 927570.6{col 26}{space 2} 302239.8{col 37}{space 1}    3.07{col 46}{space 3}0.002{col 54}{space 4} 333118.1{col 67}{space 3}  1522023
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.53e+07{col 26}{space 2} 599785.3{col 37}{space 1}   25.55{col 46}{space 3}0.000{col 54}{space 4} 1.41e+07{col 67}{space 3} 1.65e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2}   569761{col 26}{space 2} 105409.8{col 37}{space 1}    5.41{col 46}{space 3}0.000{col 54}{space 4} 362438.4{col 67}{space 3} 777083.5
{txt}{space 9}IBB {c |}{col 14}{res}{space 2}-150531.3{col 26}{space 2} 124657.7{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}  -395711{col 67}{space 3} 94648.43
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 1.32e+08{col 26}{space 2} 4.13e+07{col 37}{space 1}    3.20{col 46}{space 3}0.002{col 54}{space 4} 5.08e+07{col 67}{space 3} 2.13e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-7.40e+07{col 26}{space 2} 2.38e+07{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-1.21e+08{col 67}{space 3}-2.72e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-109083.9{col 26}{space 2} 30177.68{col 37}{space 1}   -3.61{col 46}{space 3}0.000{col 54}{space 4}  -168438{col 67}{space 3}-49729.67
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 62150.79{col 26}{space 2} 41899.45{col 37}{space 1}    1.48{col 46}{space 3}0.139{col 54}{space 4}-20258.06{col 67}{space 3} 144559.6
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 292707.8{col 26}{space 2} 433271.6{col 37}{space 1}    0.68{col 46}{space 3}0.500{col 54}{space 4}-559461.1{col 67}{space 3}  1144877
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.89e+09{col 26}{space 2} 6.08e+08{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-3.09e+09{col 67}{space 3}-6.96e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model3

. *Model for years 2002-2009

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2001 & Year < 2010

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       366
{txt}{hline 13}{c +}{hline 34}   F(9, 356)       = {res}   186.75
{txt}       Model {c |} {res} 1.9344e+17         9  2.1493e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.0972e+16       356  1.1509e+14   {txt}R-squared       ={res}    0.8252
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8208
{txt}       Total {c |} {res} 2.3441e+17       365  6.4222e+14   {txt}Root MSE        =   {res} 1.1e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2}  1208225{col 26}{space 2} 265398.1{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4} 686280.2{col 67}{space 3}  1730171
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.46e+07{col 26}{space 2} 555351.3{col 37}{space 1}   26.25{col 46}{space 3}0.000{col 54}{space 4} 1.35e+07{col 67}{space 3} 1.57e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 381745.5{col 26}{space 2}  91748.8{col 37}{space 1}    4.16{col 46}{space 3}0.000{col 54}{space 4} 201307.7{col 67}{space 3} 562183.2
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 66723.49{col 26}{space 2} 106871.5{col 37}{space 1}    0.62{col 46}{space 3}0.533{col 54}{space 4}-143455.3{col 67}{space 3} 276902.2
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 7.42e+07{col 26}{space 2} 3.62e+07{col 37}{space 1}    2.05{col 46}{space 3}0.041{col 54}{space 4}  2948378{col 67}{space 3} 1.45e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-5.33e+07{col 26}{space 2} 2.05e+07{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-9.36e+07{col 67}{space 3}-1.29e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-66236.93{col 26}{space 2} 26321.22{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-118001.6{col 67}{space 3}-14472.31
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 51238.06{col 26}{space 2} 35553.93{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-18684.07{col 67}{space 3} 121160.2
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 559693.6{col 26}{space 2} 377975.3{col 37}{space 1}    1.48{col 46}{space 3}0.140{col 54}{space 4}-183651.5{col 67}{space 3}  1303039
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.44e+09{col 26}{space 2} 5.33e+08{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4}-3.49e+09{col 67}{space 3}-1.40e+09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model4

. *Model for years 2003-2010

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2002 & Year < 2011

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       373
{txt}{hline 13}{c +}{hline 34}   F(9, 363)       = {res}   192.32
{txt}       Model {c |} {res} 1.9141e+17         9  2.1268e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.0142e+16       363  1.1058e+14   {txt}R-squared       ={res}    0.8266
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8223
{txt}       Total {c |} {res} 2.3155e+17       372  6.2245e+14   {txt}Root MSE        =   {res} 1.1e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2}  1028380{col 26}{space 2} 251526.3{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} 533748.6{col 67}{space 3}  1523012
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.52e+07{col 26}{space 2} 542278.2{col 37}{space 1}   28.00{col 46}{space 3}0.000{col 54}{space 4} 1.41e+07{col 67}{space 3} 1.63e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 324650.3{col 26}{space 2} 88106.24{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} 151387.6{col 67}{space 3}   497913
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 91654.16{col 26}{space 2}   105856{col 37}{space 1}    0.87{col 46}{space 3}0.387{col 54}{space 4}-116513.8{col 67}{space 3} 299822.1
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 5.89e+07{col 26}{space 2} 3.44e+07{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4} -8876139{col 67}{space 3} 1.27e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-4.24e+07{col 26}{space 2} 1.98e+07{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-8.14e+07{col 67}{space 3} -3481332
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-53228.06{col 26}{space 2} 25865.82{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-104093.7{col 67}{space 3}-2362.381
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 25375.93{col 26}{space 2} 34539.49{col 37}{space 1}    0.73{col 46}{space 3}0.463{col 54}{space 4}-42546.69{col 67}{space 3} 93298.56
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 640698.1{col 26}{space 2} 363552.3{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-74235.02{col 67}{space 3}  1355631
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.08e+09{col 26}{space 2} 5.05e+08{col 37}{space 1}   -4.13{col 46}{space 3}0.000{col 54}{space 4}-3.08e+09{col 67}{space 3}-1.09e+09
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model5

. *Model for years 2004-2011

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2003 & Year < 2012

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       385
{txt}{hline 13}{c +}{hline 34}   F(9, 375)       = {res}   234.41
{txt}       Model {c |} {res} 2.2571e+17         9  2.5079e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.0120e+16       375  1.0699e+14   {txt}R-squared       ={res}    0.8491
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8455
{txt}       Total {c |} {res} 2.6583e+17       384  6.9226e+14   {txt}Root MSE        =   {res} 1.0e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 894573.6{col 26}{space 2} 231715.2{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} 438949.7{col 67}{space 3}  1350198
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.61e+07{col 26}{space 2} 532622.9{col 37}{space 1}   30.15{col 46}{space 3}0.000{col 54}{space 4} 1.50e+07{col 67}{space 3} 1.71e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 306043.5{col 26}{space 2} 87030.85{col 37}{space 1}    3.52{col 46}{space 3}0.000{col 54}{space 4} 134913.8{col 67}{space 3} 477173.1
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 144684.5{col 26}{space 2} 107097.1{col 37}{space 1}    1.35{col 46}{space 3}0.178{col 54}{space 4}-65901.57{col 67}{space 3} 355270.5
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 6.99e+07{col 26}{space 2} 3.46e+07{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4}  1798074{col 67}{space 3} 1.38e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-4.69e+07{col 26}{space 2} 2.00e+07{col 37}{space 1}   -2.34{col 46}{space 3}0.020{col 54}{space 4}-8.62e+07{col 67}{space 3} -7506808
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-58393.09{col 26}{space 2} 25733.82{col 37}{space 1}   -2.27{col 46}{space 3}0.024{col 54}{space 4}-108993.8{col 67}{space 3}-7792.414
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 58762.15{col 26}{space 2} 33785.88{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-7671.361{col 67}{space 3} 125195.7
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 497984.2{col 26}{space 2} 350883.3{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4}-191961.2{col 67}{space 3}  1187930
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.82e+09{col 26}{space 2} 4.66e+08{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-2.74e+09{col 67}{space 3}-9.04e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model4

. *Model for years 2005-2012

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2004 & Year < 2013

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       384
{txt}{hline 13}{c +}{hline 34}   F(9, 374)       = {res}   248.36
{txt}       Model {c |} {res} 2.2892e+17         9  2.5435e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.8302e+16       374  1.0241e+14   {txt}R-squared       ={res}    0.8567
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8532
{txt}       Total {c |} {res} 2.6722e+17       383  6.9770e+14   {txt}Root MSE        =   {res} 1.0e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 552723.9{col 26}{space 2}   224568{col 37}{space 1}    2.46{col 46}{space 3}0.014{col 54}{space 4} 111149.7{col 67}{space 3} 994298.2
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.62e+07{col 26}{space 2} 523215.6{col 37}{space 1}   30.89{col 46}{space 3}0.000{col 54}{space 4} 1.51e+07{col 67}{space 3} 1.72e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 250811.7{col 26}{space 2} 86395.37{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} 80930.16{col 67}{space 3} 420693.3
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 252359.9{col 26}{space 2} 112171.4{col 37}{space 1}    2.25{col 46}{space 3}0.025{col 54}{space 4} 31794.19{col 67}{space 3} 472925.6
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 3.54e+07{col 26}{space 2} 3.41e+07{col 37}{space 1}    1.04{col 46}{space 3}0.301{col 54}{space 4}-3.17e+07{col 67}{space 3} 1.02e+08
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-3.73e+07{col 26}{space 2} 1.93e+07{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-7.53e+07{col 67}{space 3} 611257.4
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-46119.49{col 26}{space 2} 25590.71{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 54}{space 4}-96439.21{col 67}{space 3} 4200.221
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 79930.18{col 26}{space 2} 32952.79{col 37}{space 1}    2.43{col 46}{space 3}0.016{col 54}{space 4} 15134.22{col 67}{space 3} 144726.2
{txt}{space 9}WPA {c |}{col 14}{res}{space 2}   710050{col 26}{space 2}   351381{col 37}{space 1}    2.02{col 46}{space 3}0.044{col 54}{space 4} 19120.04{col 67}{space 3}  1400980
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.13e+09{col 26}{space 2} 4.52e+08{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-2.02e+09{col 67}{space 3}-2.38e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model5

. *Model for years 2006-2013

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2005 & Year < 2014

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       378
{txt}{hline 13}{c +}{hline 34}   F(9, 368)       = {res}   259.47
{txt}       Model {c |} {res} 2.2667e+17         9  2.5185e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.5719e+16       368  9.7062e+13   {txt}R-squared       ={res}    0.8639
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8605
{txt}       Total {c |} {res} 2.6238e+17       377  6.9598e+14   {txt}Root MSE        =   {res} 9.9e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 73429.97{col 26}{space 2} 224598.2{col 37}{space 1}    0.33{col 46}{space 3}0.744{col 54}{space 4}-368226.9{col 67}{space 3} 515086.8
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.64e+07{col 26}{space 2} 536502.2{col 37}{space 1}   30.54{col 46}{space 3}0.000{col 54}{space 4} 1.53e+07{col 67}{space 3} 1.74e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 294928.6{col 26}{space 2} 79987.56{col 37}{space 1}    3.69{col 46}{space 3}0.000{col 54}{space 4} 137638.6{col 67}{space 3} 452218.7
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 453967.3{col 26}{space 2} 111323.9{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} 235056.5{col 67}{space 3} 672878.2
{txt}{space 9}OBP {c |}{col 14}{res}{space 2} 1.28e+07{col 26}{space 2} 3.23e+07{col 37}{space 1}    0.40{col 46}{space 3}0.692{col 54}{space 4}-5.07e+07{col 67}{space 3} 7.63e+07
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-4.30e+07{col 26}{space 2} 1.81e+07{col 37}{space 1}   -2.38{col 46}{space 3}0.018{col 54}{space 4}-7.85e+07{col 67}{space 3} -7426980
{txt}{space 9}wRC {c |}{col 14}{res}{space 2} -64734.8{col 26}{space 2} 24358.76{col 37}{space 1}   -2.66{col 46}{space 3}0.008{col 54}{space 4}-112634.6{col 67}{space 3}-16834.98
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 130859.5{col 26}{space 2} 33844.32{col 37}{space 1}    3.87{col 46}{space 3}0.000{col 54}{space 4} 64306.97{col 67}{space 3}   197412
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 669217.6{col 26}{space 2} 344897.5{col 37}{space 1}    1.94{col 46}{space 3}0.053{col 54}{space 4}-8999.696{col 67}{space 3}  1347435
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.56e+08{col 26}{space 2} 4.53e+08{col 37}{space 1}   -0.34{col 46}{space 3}0.731{col 54}{space 4}-1.05e+09{col 67}{space 3} 7.35e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model6

. *Model for years 2007-2014

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2006 & Year < 2015

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       383
{txt}{hline 13}{c +}{hline 34}   F(9, 373)       = {res}   284.80
{txt}       Model {c |} {res} 2.3372e+17         9  2.5969e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.4012e+16       373  9.1184e+13   {txt}R-squared       ={res}    0.8730
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8699
{txt}       Total {c |} {res} 2.6773e+17       382  7.0087e+14   {txt}Root MSE        =   {res} 9.5e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2}-42223.04{col 26}{space 2}   218233{col 37}{space 1}   -0.19{col 46}{space 3}0.847{col 54}{space 4}-471344.3{col 67}{space 3} 386898.3
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.66e+07{col 26}{space 2} 524941.6{col 37}{space 1}   31.59{col 46}{space 3}0.000{col 54}{space 4} 1.56e+07{col 67}{space 3} 1.76e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 341546.4{col 26}{space 2} 76659.51{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} 190807.4{col 67}{space 3} 492285.4
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 462184.9{col 26}{space 2} 109659.8{col 37}{space 1}    4.21{col 46}{space 3}0.000{col 54}{space 4}   246556{col 67}{space 3} 677813.8
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}  5413839{col 26}{space 2} 3.15e+07{col 37}{space 1}    0.17{col 46}{space 3}0.863{col 54}{space 4}-5.65e+07{col 67}{space 3} 6.73e+07
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-5.21e+07{col 26}{space 2} 1.69e+07{col 37}{space 1}   -3.08{col 46}{space 3}0.002{col 54}{space 4}-8.54e+07{col 67}{space 3}-1.88e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-70197.62{col 26}{space 2} 23652.13{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-116705.8{col 67}{space 3}-23689.39
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 120681.2{col 26}{space 2} 32834.23{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} 56117.76{col 67}{space 3} 185244.6
{txt}{space 9}WPA {c |}{col 14}{res}{space 2}   962272{col 26}{space 2}   339704{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4}   294297{col 67}{space 3}  1630247
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 8.21e+07{col 26}{space 2} 4.41e+08{col 37}{space 1}    0.19{col 46}{space 3}0.852{col 54}{space 4}-7.85e+08{col 67}{space 3} 9.50e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model6

. *Model for years 2008-2015

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2007 & Year < 2016

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       366
{txt}{hline 13}{c +}{hline 34}   F(9, 356)       = {res}   284.12
{txt}       Model {c |} {res} 2.2878e+17         9  2.5420e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.1851e+16       356  8.9468e+13   {txt}R-squared       ={res}    0.8778
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8747
{txt}       Total {c |} {res} 2.6063e+17       365  7.1405e+14   {txt}Root MSE        =   {res} 9.5e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2}-25067.01{col 26}{space 2} 229486.8{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-476387.2{col 67}{space 3} 426253.2
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.76e+07{col 26}{space 2} 561203.9{col 37}{space 1}   31.30{col 46}{space 3}0.000{col 54}{space 4} 1.65e+07{col 67}{space 3} 1.87e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 287551.6{col 26}{space 2} 77486.77{col 37}{space 1}    3.71{col 46}{space 3}0.000{col 54}{space 4} 135162.2{col 67}{space 3}   439941
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 353559.1{col 26}{space 2} 116209.6{col 37}{space 1}    3.04{col 46}{space 3}0.003{col 54}{space 4} 125015.5{col 67}{space 3} 582102.8
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}  7868593{col 26}{space 2} 3.24e+07{col 37}{space 1}    0.24{col 46}{space 3}0.808{col 54}{space 4}-5.58e+07{col 67}{space 3} 7.15e+07
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-3.30e+07{col 26}{space 2} 1.66e+07{col 37}{space 1}   -1.99{col 46}{space 3}0.047{col 54}{space 4}-6.57e+07{col 67}{space 3}-416767.6
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-60559.88{col 26}{space 2} 24118.31{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-107992.2{col 67}{space 3}-13127.62
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 108064.3{col 26}{space 2} 32667.56{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} 43818.67{col 67}{space 3}   172310
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 745188.1{col 26}{space 2} 345249.5{col 37}{space 1}    2.16{col 46}{space 3}0.032{col 54}{space 4} 66203.29{col 67}{space 3}  1424173
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 3.93e+07{col 26}{space 2} 4.64e+08{col 37}{space 1}    0.08{col 46}{space 3}0.932{col 54}{space 4}-8.73e+08{col 67}{space 3} 9.51e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model7

. *Model for years 2009-2016

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2008 & Year < 2017

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       361
{txt}{hline 13}{c +}{hline 34}   F(9, 351)       = {res}   307.18
{txt}       Model {c |} {res} 1.6792e+17         9  1.8657e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.1319e+16       351  6.0737e+13   {txt}R-squared       ={res}    0.8873
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8845
{txt}       Total {c |} {res} 1.8924e+17       360  5.2566e+14   {txt}Root MSE        =   {res} 7.8e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 510196.6{col 26}{space 2} 195993.6{col 37}{space 1}    2.60{col 46}{space 3}0.010{col 54}{space 4} 124727.1{col 67}{space 3}   895666
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.56e+07{col 26}{space 2} 487383.7{col 37}{space 1}   32.06{col 46}{space 3}0.000{col 54}{space 4} 1.47e+07{col 67}{space 3} 1.66e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 109401.9{col 26}{space 2} 63572.85{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-15629.67{col 67}{space 3} 234433.6
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 394860.8{col 26}{space 2} 97510.77{col 37}{space 1}    4.05{col 46}{space 3}0.000{col 54}{space 4}   203082{col 67}{space 3} 586639.7
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}-4.84e+07{col 26}{space 2} 2.65e+07{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-1.01e+08{col 67}{space 3}  3776386
{txt}{space 9}SLG {c |}{col 14}{res}{space 2} -5883210{col 26}{space 2} 1.33e+07{col 37}{space 1}   -0.44{col 46}{space 3}0.657{col 54}{space 4}-3.20e+07{col 67}{space 3} 2.02e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2} -21497.8{col 26}{space 2} 20385.33{col 37}{space 1}   -1.05{col 46}{space 3}0.292{col 54}{space 4}-61590.55{col 67}{space 3} 18594.94
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 135841.9{col 26}{space 2} 26536.66{col 37}{space 1}    5.12{col 46}{space 3}0.000{col 54}{space 4} 83651.04{col 67}{space 3} 188032.7
{txt}{space 9}WPA {c |}{col 14}{res}{space 2}   948186{col 26}{space 2} 283743.9{col 37}{space 1}    3.34{col 46}{space 3}0.001{col 54}{space 4} 390133.9{col 67}{space 3}  1506238
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.03e+09{col 26}{space 2} 3.96e+08{col 37}{space 1}   -2.59{col 46}{space 3}0.010{col 54}{space 4}-1.81e+09{col 67}{space 3}-2.48e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model8

. *Model for years 2010-2017

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2009 & Year < 2018

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       354
{txt}{hline 13}{c +}{hline 34}   F(9, 344)       = {res}   293.09
{txt}       Model {c |} {res} 1.4220e+17         9  1.5799e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.8544e+16       344  5.3906e+13   {txt}R-squared       ={res}    0.8846
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8816
{txt}       Total {c |} {res} 1.6074e+17       353  4.5535e+14   {txt}Root MSE        =   {res} 7.3e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 655639.5{col 26}{space 2} 183757.3{col 37}{space 1}    3.57{col 46}{space 3}0.000{col 54}{space 4} 294210.2{col 67}{space 3}  1017069
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.50e+07{col 26}{space 2} 478080.9{col 37}{space 1}   31.42{col 46}{space 3}0.000{col 54}{space 4} 1.41e+07{col 67}{space 3} 1.60e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2}   121207{col 26}{space 2} 59237.95{col 37}{space 1}    2.05{col 46}{space 3}0.042{col 54}{space 4} 4692.846{col 67}{space 3} 237721.2
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 327717.1{col 26}{space 2} 100348.8{col 37}{space 1}    3.27{col 46}{space 3}0.001{col 54}{space 4} 130342.7{col 67}{space 3} 525091.5
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}-4.00e+07{col 26}{space 2} 2.53e+07{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-8.97e+07{col 67}{space 3}  9650032
{txt}{space 9}SLG {c |}{col 14}{res}{space 2} -7099268{col 26}{space 2} 1.27e+07{col 37}{space 1}   -0.56{col 46}{space 3}0.577{col 54}{space 4}-3.21e+07{col 67}{space 3} 1.79e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-11974.53{col 26}{space 2} 20132.88{col 37}{space 1}   -0.59{col 46}{space 3}0.552{col 54}{space 4}-51573.57{col 67}{space 3} 27624.51
{txt}{space 9}RAR {c |}{col 14}{res}{space 2}   131127{col 26}{space 2} 25769.21{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} 80441.94{col 67}{space 3}   181812
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 933291.2{col 26}{space 2} 274111.2{col 37}{space 1}    3.40{col 46}{space 3}0.001{col 54}{space 4} 394146.2{col 67}{space 3}  1472436
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.32e+09{col 26}{space 2} 3.71e+08{col 37}{space 1}   -3.56{col 46}{space 3}0.000{col 54}{space 4}-2.05e+09{col 67}{space 3}-5.93e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model9

. *Model for years 2011-2018

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2010 & Year < 2019

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       343
{txt}{hline 13}{c +}{hline 34}   F(9, 333)       = {res}   248.86
{txt}       Model {c |} {res} 1.2575e+17         9  1.3972e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.8696e+16       333  5.6144e+13   {txt}R-squared       ={res}    0.8706
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8671
{txt}       Total {c |} {res} 1.4444e+17       342  4.2235e+14   {txt}Root MSE        =   {res} 7.5e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 320332.5{col 26}{space 2} 188692.2{col 37}{space 1}    1.70{col 46}{space 3}0.091{col 54}{space 4}-50846.45{col 67}{space 3} 691511.4
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.50e+07{col 26}{space 2} 505685.5{col 37}{space 1}   29.69{col 46}{space 3}0.000{col 54}{space 4} 1.40e+07{col 67}{space 3} 1.60e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 95451.48{col 26}{space 2} 59526.02{col 37}{space 1}    1.60{col 46}{space 3}0.110{col 54}{space 4}-21642.95{col 67}{space 3} 212545.9
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 312855.9{col 26}{space 2} 107223.5{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} 101935.2{col 67}{space 3} 523776.7
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}-5.64e+07{col 26}{space 2} 2.65e+07{col 37}{space 1}   -2.13{col 46}{space 3}0.034{col 54}{space 4}-1.09e+08{col 67}{space 3} -4289961
{txt}{space 9}SLG {c |}{col 14}{res}{space 2} -5762162{col 26}{space 2} 1.31e+07{col 37}{space 1}   -0.44{col 46}{space 3}0.660{col 54}{space 4}-3.15e+07{col 67}{space 3} 2.00e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2} 338.0059{col 26}{space 2} 20658.13{col 37}{space 1}    0.02{col 46}{space 3}0.987{col 54}{space 4}-40298.88{col 67}{space 3}  40974.9
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 130085.8{col 26}{space 2} 27232.49{col 37}{space 1}    4.78{col 46}{space 3}0.000{col 54}{space 4} 76516.35{col 67}{space 3} 183655.2
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 941928.7{col 26}{space 2} 296195.6{col 37}{space 1}    3.18{col 46}{space 3}0.002{col 54}{space 4} 359278.3{col 67}{space 3}  1524579
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.44e+08{col 26}{space 2} 3.81e+08{col 37}{space 1}   -1.69{col 46}{space 3}0.092{col 54}{space 4}-1.39e+09{col 67}{space 3} 1.05e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model10

. *Model for years 2012-2019

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2011 & Year < 2020

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       316
{txt}{hline 13}{c +}{hline 34}   F(9, 306)       = {res}   192.40
{txt}       Model {c |} {res} 8.7275e+16         9  9.6972e+15   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.5422e+16       306  5.0400e+13   {txt}R-squared       ={res}    0.8498
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8454
{txt}       Total {c |} {res} 1.0270e+17       315  3.2602e+14   {txt}Root MSE        =   {res} 7.1e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 317488.9{col 26}{space 2} 192684.4{col 37}{space 1}    1.65{col 46}{space 3}0.100{col 54}{space 4}-61665.26{col 67}{space 3} 696643.1
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.43e+07{col 26}{space 2} 526271.3{col 37}{space 1}   27.22{col 46}{space 3}0.000{col 54}{space 4} 1.33e+07{col 67}{space 3} 1.54e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 115348.4{col 26}{space 2}    57695{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} 1819.296{col 67}{space 3} 228877.6
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 363579.5{col 26}{space 2} 102163.3{col 37}{space 1}    3.56{col 46}{space 3}0.000{col 54}{space 4}   162548{col 67}{space 3}   564611
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}-5.29e+07{col 26}{space 2} 2.63e+07{col 37}{space 1}   -2.01{col 46}{space 3}0.045{col 54}{space 4}-1.05e+08{col 67}{space 3} -1221481
{txt}{space 9}SLG {c |}{col 14}{res}{space 2}-831957.7{col 26}{space 2} 1.28e+07{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-2.59e+07{col 67}{space 3} 2.43e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-10114.56{col 26}{space 2} 19995.11{col 37}{space 1}   -0.51{col 46}{space 3}0.613{col 54}{space 4}-49459.88{col 67}{space 3} 29230.76
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 124076.5{col 26}{space 2} 26715.38{col 37}{space 1}    4.64{col 46}{space 3}0.000{col 54}{space 4} 71507.42{col 67}{space 3} 176645.6
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 990275.9{col 26}{space 2} 291765.8{col 37}{space 1}    3.39{col 46}{space 3}0.001{col 54}{space 4} 416154.8{col 67}{space 3}  1564397
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.40e+08{col 26}{space 2} 3.88e+08{col 37}{space 1}   -1.65{col 46}{space 3}0.100{col 54}{space 4}-1.40e+09{col 67}{space 3} 1.24e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model11

. *Model for years 2013-2020

. regress Guarantee Year Years HR IBB OBP SLG wRC RAR WPA if Year > 2012 & Year < 2021

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       266
{txt}{hline 13}{c +}{hline 34}   F(9, 256)       = {res}   161.68
{txt}       Model {c |} {res} 7.5440e+16         9  8.3822e+15   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.3272e+16       256  5.1844e+13   {txt}R-squared       ={res}    0.8504
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8451
{txt}       Total {c |} {res} 8.8712e+16       265  3.3476e+14   {txt}Root MSE        =   {res} 7.2e+06

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 29121.75{col 26}{space 2} 244175.8{col 37}{space 1}    0.12{col 46}{space 3}0.905{col 54}{space 4}-451727.3{col 67}{space 3} 509970.8
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.39e+07{col 26}{space 2} 586463.4{col 37}{space 1}   23.75{col 46}{space 3}0.000{col 54}{space 4} 1.28e+07{col 67}{space 3} 1.51e+07
{txt}{space 10}HR {c |}{col 14}{res}{space 2} 160687.7{col 26}{space 2}  62294.5{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} 38012.81{col 67}{space 3} 283362.7
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 368338.7{col 26}{space 2} 111582.8{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} 148601.5{col 67}{space 3} 588075.8
{txt}{space 9}OBP {c |}{col 14}{res}{space 2}-2.36e+07{col 26}{space 2} 2.88e+07{col 37}{space 1}   -0.82{col 46}{space 3}0.413{col 54}{space 4}-8.04e+07{col 67}{space 3} 3.31e+07
{txt}{space 9}SLG {c |}{col 14}{res}{space 2} -7421488{col 26}{space 2} 1.39e+07{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 54}{space 4}-3.49e+07{col 67}{space 3} 2.00e+07
{txt}{space 9}wRC {c |}{col 14}{res}{space 2}-21286.93{col 26}{space 2} 21830.98{col 37}{space 1}   -0.98{col 46}{space 3}0.330{col 54}{space 4}-64278.11{col 67}{space 3} 21704.26
{txt}{space 9}RAR {c |}{col 14}{res}{space 2} 136063.1{col 26}{space 2} 30389.39{col 37}{space 1}    4.48{col 46}{space 3}0.000{col 54}{space 4} 76218.06{col 67}{space 3} 195908.1
{txt}{space 9}WPA {c |}{col 14}{res}{space 2}   877150{col 26}{space 2} 321915.1{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4} 243210.9{col 67}{space 3}  1511089
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.49e+07{col 26}{space 2} 4.92e+08{col 37}{space 1}   -0.13{col 46}{space 3}0.895{col 54}{space 4}-1.03e+09{col 67}{space 3} 9.03e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo Model12

. *Comparing model for years 1999-2006 with model for years 2012-2019

. esttab  Model1 Model11,  mtitles(1999-2006 2012-2019) title(Comparing two rolling samples) nonumber star(* 0.10 ** 0.05 *** 0.01) staraux  b(3) se(3) o (_cons) scalars( "r2_a Adj R-Squared" "rmse SEE" "F F-ratio" "rss SSR") varwidth(16)
{res}
{txt}Comparing two rolling samples
{txt}{hline 48}
{txt}                  1999-2006     2012-2019   
{txt}{hline 48}
{txt}_cons           {res}   -1.136e+09      -6.400e+08   {txt}
                {res} {ralign 12:{txt:(}4.979e+08{txt:)}}**  {ralign 12:{txt:(}3.881e+08{txt:)}}   {txt}

{txt}Year            {res}   549626.626      317488.928   {txt}
                {res} {ralign 12:{txt:(}247753.765{txt:)}}**  {ralign 12:{txt:(}192684.444{txt:)}}   {txt}

{txt}Years           {res} 12545989.234    14324510.109   {txt}
                {res} {ralign 12:{txt:(}560536.320{txt:)}}*** {ralign 12:{txt:(}526271.308{txt:)}}***{txt}

{txt}HR              {res}   284181.963      115348.442   {txt}
                {res} {ralign 12:{txt:(}88113.066{txt:)}}*** {ralign 12:{txt:(}57694.999{txt:)}}** {txt}

{txt}IBB             {res}   -72780.790      363579.511   {txt}
                {res} {ralign 12:{txt:(}114126.823{txt:)}}    {ralign 12:{txt:(}102163.291{txt:)}}***{txt}

{txt}OBP             {res} 89097823.538      -5.288e+07   {txt}
                {res} {ralign 12:{txt:(}34584801.404{txt:)}}**  {ralign 12:{txt:(}26254701.954{txt:)}}** {txt}

{txt}SLG             {res}   -2.239e+07     -831957.684   {txt}
                {res} {ralign 12:{txt:(}19904711.718{txt:)}}    {ralign 12:{txt:(}12758556.869{txt:)}}   {txt}

{txt}wRC             {res}   -69607.790      -10114.561   {txt}
                {res} {ralign 12:{txt:(}26811.467{txt:)}}*** {ralign 12:{txt:(}19995.112{txt:)}}   {txt}

{txt}RAR             {res}    83144.778      124076.521   {txt}
                {res} {ralign 12:{txt:(}36717.489{txt:)}}**  {ralign 12:{txt:(}26715.379{txt:)}}***{txt}

{txt}WPA             {res}   335468.922      990275.940   {txt}
                {res} {ralign 12:{txt:(}375907.531{txt:)}}    {ralign 12:{txt:(}291765.768{txt:)}}***{txt}
{txt}{hline 48}
{txt}N               {res}          336             316   {txt}
{txt}Adj R-Squared   {res}        0.799           0.845   {txt}
{txt}SEE             {res} 10578098.799     7099309.683   {txt}
{txt}F-ratio         {res}      149.148         192.404   {txt}
{txt}SSR             {res}    3.648e+16       1.542e+16   {txt}
{txt}{hline 48}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. *Comparing first 3 time interval models

. esttab  Model1 Model2 Model3,  mtitles(1999-2006 2000-2007 2001-2008) title(Comparing models for different time intervals) nonumber star(* 0.10 ** 0.05 *** 0.01) staraux  b(3) se(3) o (_cons) scalars( "r2_a Adj R-Squared" "rmse SEE" "F F-ratio" "rss SSR") varwidth(16)
{res}
{txt}Comparing models for different time intervals
{txt}{hline 64}
{txt}                  1999-2006     2000-2007     2001-2008   
{txt}{hline 64}
{txt}_cons           {res}   -1.136e+09      -1.113e+09      -1.892e+09   {txt}
                {res} {ralign 12:{txt:(}4.979e+08{txt:)}}**  {ralign 12:{txt:(}5.515e+08{txt:)}}**  {ralign 12:{txt:(}6.080e+08{txt:)}}***{txt}

{txt}Year            {res}   549626.626      540424.256      927570.577   {txt}
                {res} {ralign 12:{txt:(}247753.765{txt:)}}**  {ralign 12:{txt:(}274204.688{txt:)}}**  {ralign 12:{txt:(}302239.812{txt:)}}***{txt}

{txt}Years           {res} 12545989.234    13602948.510    15323402.022   {txt}
                {res} {ralign 12:{txt:(}560536.320{txt:)}}*** {ralign 12:{txt:(}549609.456{txt:)}}*** {ralign 12:{txt:(}599785.344{txt:)}}***{txt}

{txt}HR              {res}   284181.963      337855.174      569760.952   {txt}
                {res} {ralign 12:{txt:(}88113.066{txt:)}}*** {ralign 12:{txt:(}92818.369{txt:)}}*** {ralign 12:{txt:(}105409.825{txt:)}}***{txt}

{txt}IBB             {res}   -72780.790      -44880.781     -150531.263   {txt}
                {res} {ralign 12:{txt:(}114126.823{txt:)}}    {ralign 12:{txt:(}111719.790{txt:)}}    {ralign 12:{txt:(}124657.668{txt:)}}   {txt}

{txt}OBP             {res} 89097823.538    76661726.857       1.321e+08   {txt}
                {res} {ralign 12:{txt:(}34584801.404{txt:)}}**  {ralign 12:{txt:(}36939825.906{txt:)}}**  {ralign 12:{txt:(}41311277.536{txt:)}}***{txt}

{txt}SLG             {res}   -2.239e+07      -2.932e+07      -7.399e+07   {txt}
                {res} {ralign 12:{txt:(}19904711.718{txt:)}}    {ralign 12:{txt:(}21161511.846{txt:)}}    {ralign 12:{txt:(}23795561.857{txt:)}}***{txt}

{txt}wRC             {res}   -69607.790      -71660.473     -109083.850   {txt}
                {res} {ralign 12:{txt:(}26811.467{txt:)}}*** {ralign 12:{txt:(}27735.686{txt:)}}**  {ralign 12:{txt:(}30177.678{txt:)}}***{txt}

{txt}RAR             {res}    83144.778       60319.302       62150.787   {txt}
                {res} {ralign 12:{txt:(}36717.489{txt:)}}**  {ralign 12:{txt:(}37685.891{txt:)}}    {ralign 12:{txt:(}41899.450{txt:)}}   {txt}

{txt}WPA             {res}   335468.922      425960.772      292707.830   {txt}
                {res} {ralign 12:{txt:(}375907.531{txt:)}}    {ralign 12:{txt:(}394585.109{txt:)}}    {ralign 12:{txt:(}433271.593{txt:)}}   {txt}
{txt}{hline 64}
{txt}N               {res}          336             335             357   {txt}
{txt}Adj R-Squared   {res}        0.799           0.812           0.816   {txt}
{txt}SEE             {res} 10578098.799    10650647.440    12118004.666   {txt}
{txt}F-ratio         {res}      149.148         160.937         175.986   {txt}
{txt}SSR             {res}    3.648e+16       3.687e+16       5.096e+16   {txt}
{txt}{hline 64}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. *Comparing next 3 time interval models

. esttab  Model4 Model5 Model6,  mtitles(2002-2009 2003-2010 2004-2011) title(Comparing models for different time intervals) nonumber star(* 0.10 ** 0.05 *** 0.01) staraux  b(3) se(3) o (_cons) scalars( "r2_a Adj R-Squared" "rmse SEE" "F F-ratio" "rss SSR") varwidth(16)
{res}
{txt}Comparing models for different time intervals
{txt}{hline 64}
{txt}                  2002-2009     2003-2010     2004-2011   
{txt}{hline 64}
{txt}_cons           {res}   -1.820e+09      -1.127e+09    82100077.714   {txt}
                {res} {ralign 12:{txt:(}4.656e+08{txt:)}}*** {ralign 12:{txt:(}4.525e+08{txt:)}}**  {ralign 12:{txt:(}4.411e+08{txt:)}}   {txt}

{txt}Year            {res}   894573.608      552723.914      -42223.037   {txt}
                {res} {ralign 12:{txt:(}231715.195{txt:)}}*** {ralign 12:{txt:(}224568.050{txt:)}}**  {ralign 12:{txt:(}218233.049{txt:)}}   {txt}

{txt}Years           {res} 16057330.766    16161840.209    16584287.488   {txt}
                {res} {ralign 12:{txt:(}532622.864{txt:)}}*** {ralign 12:{txt:(}523215.602{txt:)}}*** {ralign 12:{txt:(}524941.557{txt:)}}***{txt}

{txt}HR              {res}   306043.497      250811.717      341546.398   {txt}
                {res} {ralign 12:{txt:(}87030.853{txt:)}}*** {ralign 12:{txt:(}86395.365{txt:)}}*** {ralign 12:{txt:(}76659.507{txt:)}}***{txt}

{txt}IBB             {res}   144684.464      252359.869      462184.884   {txt}
                {res} {ralign 12:{txt:(}107097.060{txt:)}}    {ralign 12:{txt:(}112171.405{txt:)}}**  {ralign 12:{txt:(}109659.776{txt:)}}***{txt}

{txt}OBP             {res} 69927737.897    35364005.536     5413838.804   {txt}
                {res} {ralign 12:{txt:(}34648482.755{txt:)}}**  {ralign 12:{txt:(}34126130.941{txt:)}}    {ralign 12:{txt:(}31467234.163{txt:)}}   {txt}

{txt}SLG             {res}   -4.688e+07      -3.733e+07      -5.213e+07   {txt}
                {res} {ralign 12:{txt:(}20022073.191{txt:)}}**  {ralign 12:{txt:(}19295706.651{txt:)}}*   {ralign 12:{txt:(}16945128.488{txt:)}}***{txt}

{txt}wRC             {res}   -58393.093      -46119.492      -70197.615   {txt}
                {res} {ralign 12:{txt:(}25733.824{txt:)}}**  {ralign 12:{txt:(}25590.712{txt:)}}*   {ralign 12:{txt:(}23652.125{txt:)}}***{txt}

{txt}RAR             {res}    58762.155       79930.185      120681.171   {txt}
                {res} {ralign 12:{txt:(}33785.878{txt:)}}*   {ralign 12:{txt:(}32952.791{txt:)}}**  {ralign 12:{txt:(}32834.235{txt:)}}***{txt}

{txt}WPA             {res}   497984.215      710050.035      962272.028   {txt}
                {res} {ralign 12:{txt:(}350883.290{txt:)}}    {ralign 12:{txt:(}351380.991{txt:)}}**  {ralign 12:{txt:(}339703.978{txt:)}}***{txt}
{txt}{hline 64}
{txt}N               {res}          385             384             383   {txt}
{txt}Adj R-Squared   {res}        0.845           0.853           0.870   {txt}
{txt}SEE             {res} 10343380.232    10119829.058     9549046.057   {txt}
{txt}F-ratio         {res}      234.413         248.364         284.798   {txt}
{txt}SSR             {res}    4.012e+16       3.830e+16       3.401e+16   {txt}
{txt}{hline 64}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. *Comparing next 3 time intervals

. esttab  Model7 Model8 Model9,  mtitles(2005-2012 2006-2013 2007-2014) title(Comparing models for different time intervals) nonumber star(* 0.10 ** 0.05 *** 0.01) staraux  b(3) se(3) o (_cons) scalars( "r2_a Adj R-Squared" "rmse SEE" "F F-ratio" "rss SSR") varwidth(16)
{res}
{txt}Comparing models for different time intervals
{txt}{hline 64}
{txt}                  2005-2012     2006-2013     2007-2014   
{txt}{hline 64}
{txt}_cons           {res} 39345904.598      -1.028e+09      -1.323e+09   {txt}
                {res} {ralign 12:{txt:(}4.638e+08{txt:)}}    {ralign 12:{txt:(}3.965e+08{txt:)}}*** {ralign 12:{txt:(}3.712e+08{txt:)}}***{txt}

{txt}Year            {res}   -25067.006      510196.565      655639.548   {txt}
                {res} {ralign 12:{txt:(}229486.807{txt:)}}    {ralign 12:{txt:(}195993.564{txt:)}}*** {ralign 12:{txt:(}183757.342{txt:)}}***{txt}

{txt}Years           {res} 17567706.483    15623135.293    15020016.114   {txt}
                {res} {ralign 12:{txt:(}561203.865{txt:)}}*** {ralign 12:{txt:(}487383.724{txt:)}}*** {ralign 12:{txt:(}478080.901{txt:)}}***{txt}

{txt}HR              {res}   287551.604      109401.946      121207.015   {txt}
                {res} {ralign 12:{txt:(}77486.773{txt:)}}*** {ralign 12:{txt:(}63572.848{txt:)}}*   {ralign 12:{txt:(}59237.945{txt:)}}** {txt}

{txt}IBB             {res}   353559.118      394860.831      327717.095   {txt}
                {res} {ralign 12:{txt:(}116209.616{txt:)}}*** {ralign 12:{txt:(}97510.765{txt:)}}*** {ralign 12:{txt:(}100348.763{txt:)}}***{txt}

{txt}OBP             {res}  7868592.581      -4.841e+07      -4.003e+07   {txt}
                {res} {ralign 12:{txt:(}32378217.896{txt:)}}    {ralign 12:{txt:(}26532626.346{txt:)}}*   {ralign 12:{txt:(}25256571.448{txt:)}}   {txt}

{txt}SLG             {res}   -3.305e+07    -5883210.397    -7099268.153   {txt}
                {res} {ralign 12:{txt:(}16592411.107{txt:)}}**  {ralign 12:{txt:(}13255868.989{txt:)}}    {ralign 12:{txt:(}12709595.796{txt:)}}   {txt}

{txt}wRC             {res}   -60559.884      -21497.805      -11974.532   {txt}
                {res} {ralign 12:{txt:(}24118.306{txt:)}}**  {ralign 12:{txt:(}20385.325{txt:)}}    {ralign 12:{txt:(}20132.881{txt:)}}   {txt}

{txt}RAR             {res}   108064.332      135841.886      131126.994   {txt}
                {res} {ralign 12:{txt:(}32667.563{txt:)}}*** {ralign 12:{txt:(}26536.655{txt:)}}*** {ralign 12:{txt:(}25769.212{txt:)}}***{txt}

{txt}WPA             {res}   745188.144      948185.969      933291.246   {txt}
                {res} {ralign 12:{txt:(}345249.463{txt:)}}**  {ralign 12:{txt:(}283743.881{txt:)}}*** {ralign 12:{txt:(}274111.227{txt:)}}***{txt}
{txt}{hline 64}
{txt}N               {res}          366             361             354   {txt}
{txt}Adj R-Squared   {res}        0.875           0.884           0.882   {txt}
{txt}SEE             {res}  9458738.626     7793406.919     7342077.077   {txt}
{txt}F-ratio         {res}      284.120         307.184         293.093   {txt}
{txt}SSR             {res}    3.185e+16       2.132e+16       1.854e+16   {txt}
{txt}{hline 64}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. *Comparing last 3 time intervals

. esttab  Model8 Model9 Model10,  mtitles(2008-2015 2009-2016 2010-2017) title(Comparing models for different time intervals) nonumber star(* 0.10 ** 0.05 *** 0.01) staraux  b(3) se(3) o (_cons) scalars( "r2_a Adj R-Squared" "rmse SEE" "F F-ratio" "rss SSR") varwidth(16)
{res}
{txt}Comparing models for different time intervals
{txt}{hline 64}
{txt}                  2008-2015     2009-2016     2010-2017   
{txt}{hline 64}
{txt}_cons           {res}   -1.028e+09      -1.323e+09      -6.440e+08   {txt}
                {res} {ralign 12:{txt:(}3.965e+08{txt:)}}*** {ralign 12:{txt:(}3.712e+08{txt:)}}*** {ralign 12:{txt:(}3.806e+08{txt:)}}*  {txt}

{txt}Year            {res}   510196.565      655639.548      320332.468   {txt}
                {res} {ralign 12:{txt:(}195993.564{txt:)}}*** {ralign 12:{txt:(}183757.342{txt:)}}*** {ralign 12:{txt:(}188692.177{txt:)}}*  {txt}

{txt}Years           {res} 15623135.293    15020016.114    15014547.102   {txt}
                {res} {ralign 12:{txt:(}487383.724{txt:)}}*** {ralign 12:{txt:(}478080.901{txt:)}}*** {ralign 12:{txt:(}505685.469{txt:)}}***{txt}

{txt}HR              {res}   109401.946      121207.015       95451.477   {txt}
                {res} {ralign 12:{txt:(}63572.848{txt:)}}*   {ralign 12:{txt:(}59237.945{txt:)}}**  {ralign 12:{txt:(}59526.016{txt:)}}   {txt}

{txt}IBB             {res}   394860.831      327717.095      312855.916   {txt}
                {res} {ralign 12:{txt:(}97510.765{txt:)}}*** {ralign 12:{txt:(}100348.763{txt:)}}*** {ralign 12:{txt:(}107223.476{txt:)}}***{txt}

{txt}OBP             {res}   -4.841e+07      -4.003e+07      -5.640e+07   {txt}
                {res} {ralign 12:{txt:(}26532626.346{txt:)}}*   {ralign 12:{txt:(}25256571.448{txt:)}}    {ralign 12:{txt:(}26490404.503{txt:)}}** {txt}

{txt}SLG             {res} -5883210.397    -7099268.153    -5762161.945   {txt}
                {res} {ralign 12:{txt:(}13255868.989{txt:)}}    {ralign 12:{txt:(}12709595.796{txt:)}}    {ralign 12:{txt:(}13093408.620{txt:)}}   {txt}

{txt}wRC             {res}   -21497.805      -11974.532         338.006   {txt}
                {res} {ralign 12:{txt:(}20385.325{txt:)}}    {ralign 12:{txt:(}20132.881{txt:)}}    {ralign 12:{txt:(}20658.133{txt:)}}   {txt}

{txt}RAR             {res}   135841.886      131126.994      130085.754   {txt}
                {res} {ralign 12:{txt:(}26536.655{txt:)}}*** {ralign 12:{txt:(}25769.212{txt:)}}*** {ralign 12:{txt:(}27232.492{txt:)}}***{txt}

{txt}WPA             {res}   948185.969      933291.246      941928.717   {txt}
                {res} {ralign 12:{txt:(}283743.881{txt:)}}*** {ralign 12:{txt:(}274111.227{txt:)}}*** {ralign 12:{txt:(}296195.616{txt:)}}***{txt}
{txt}{hline 64}
{txt}N               {res}          361             354             343   {txt}
{txt}Adj R-Squared   {res}        0.884           0.882           0.867   {txt}
{txt}SEE             {res}  7793406.919     7342077.077     7492945.465   {txt}
{txt}F-ratio         {res}      307.184         293.093         248.858   {txt}
{txt}SSR             {res}    2.132e+16       1.854e+16       1.870e+16   {txt}
{txt}{hline 64}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. *Developing models to compare defined pre-Moneyball and post-Moneyball time periods 

. *Pre-Moneyball Model

. regress Guarantee Year Age Years pastWAR RBI IBB SB AVG BB K ISO WPA if Year > 1998 & Year < 2005

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       234
{txt}{hline 13}{c +}{hline 34}   F(12, 221)      = {res}    65.67
{txt}       Model {c |} {res} 1.1562e+17        12  9.6352e+15   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.2426e+16       221  1.4672e+14   {txt}R-squared       ={res}    0.7810
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.7691
{txt}       Total {c |} {res} 1.4805e+17       233  6.3540e+14   {txt}Root MSE        =   {res} 1.2e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2} 536123.1{col 26}{space 2} 450791.2{col 37}{space 1}    1.19{col 46}{space 3}0.236{col 54}{space 4}-352276.5{col 67}{space 3}  1424523
{txt}{space 9}Age {c |}{col 14}{res}{space 2}   186135{col 26}{space 2} 316868.8{col 37}{space 1}    0.59{col 46}{space 3}0.558{col 54}{space 4}-438336.2{col 67}{space 3} 810606.3
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.32e+07{col 26}{space 2} 871156.2{col 37}{space 1}   15.10{col 46}{space 3}0.000{col 54}{space 4} 1.14e+07{col 67}{space 3} 1.49e+07
{txt}{space 5}pastWAR {c |}{col 14}{res}{space 2} 625254.8{col 26}{space 2} 483859.8{col 37}{space 1}    1.29{col 46}{space 3}0.198{col 54}{space 4}-328315.1{col 67}{space 3}  1578825
{txt}{space 9}RBI {c |}{col 14}{res}{space 2} 11490.37{col 26}{space 2} 24352.84{col 37}{space 1}    0.47{col 46}{space 3}0.638{col 54}{space 4}-36503.13{col 67}{space 3} 59483.87
{txt}{space 9}IBB {c |}{col 14}{res}{space 2}-738.0582{col 26}{space 2} 154250.5{col 37}{space 1}   -0.00{col 46}{space 3}0.996{col 54}{space 4}-304728.3{col 67}{space 3} 303252.2
{txt}{space 10}SB {c |}{col 14}{res}{space 2}-50003.41{col 26}{space 2} 45479.42{col 37}{space 1}   -1.10{col 46}{space 3}0.273{col 54}{space 4}-139632.3{col 67}{space 3} 39625.45
{txt}{space 9}AVG {c |}{col 14}{res}{space 2} 5.25e+07{col 26}{space 2} 4.50e+07{col 37}{space 1}    1.17{col 46}{space 3}0.245{col 54}{space 4}-3.62e+07{col 67}{space 3} 1.41e+08
{txt}{space 10}BB {c |}{col 14}{res}{space 2} 3.50e+07{col 26}{space 2} 3.20e+07{col 37}{space 1}    1.09{col 46}{space 3}0.275{col 54}{space 4}-2.81e+07{col 67}{space 3} 9.81e+07
{txt}{space 11}K {c |}{col 14}{res}{space 2} 2.30e+07{col 26}{space 2} 2.30e+07{col 37}{space 1}    1.00{col 46}{space 3}0.318{col 54}{space 4}-2.23e+07{col 67}{space 3} 6.84e+07
{txt}{space 9}ISO {c |}{col 14}{res}{space 2} 1.16e+07{col 26}{space 2} 2.47e+07{col 37}{space 1}    0.47{col 46}{space 3}0.640{col 54}{space 4}-3.72e+07{col 67}{space 3} 6.04e+07
{txt}{space 9}WPA {c |}{col 14}{res}{space 2} 275866.2{col 26}{space 2} 525639.5{col 37}{space 1}    0.52{col 46}{space 3}0.600{col 54}{space 4}-760041.3{col 67}{space 3}  1311774
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.12e+09{col 26}{space 2} 9.06e+08{col 37}{space 1}   -1.24{col 46}{space 3}0.218{col 54}{space 4}-2.91e+09{col 67}{space 3} 6.66e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo PreMoneyball

. *Post-Moneyball Model

. regress Guarantee Year Age Years pastWAR RBI IBB SB AVG BB K ISO WPA if Year > 2004 & Year < 2011

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}       285
{txt}{hline 13}{c +}{hline 34}   F(12, 272)      = {res}   123.02
{txt}       Model {c |} {res} 1.7743e+17        12  1.4785e+16   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3.2691e+16       272  1.2019e+14   {txt}R-squared       ={res}    0.8444
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.8375
{txt}       Total {c |} {res} 2.1012e+17       284  7.3985e+14   {txt}Root MSE        =   {res} 1.1e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   Guarantee{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}Year {c |}{col 14}{res}{space 2}  1236851{col 26}{space 2} 395528.8{col 37}{space 1}    3.13{col 46}{space 3}0.002{col 54}{space 4} 458163.7{col 67}{space 3}  2015538
{txt}{space 9}Age {c |}{col 14}{res}{space 2} 248182.7{col 26}{space 2} 230403.6{col 37}{space 1}    1.08{col 46}{space 3}0.282{col 54}{space 4}-205418.4{col 67}{space 3} 701783.9
{txt}{space 7}Years {c |}{col 14}{res}{space 2} 1.63e+07{col 26}{space 2} 714323.6{col 37}{space 1}   22.80{col 46}{space 3}0.000{col 54}{space 4} 1.49e+07{col 67}{space 3} 1.77e+07
{txt}{space 5}pastWAR {c |}{col 14}{res}{space 2} 380499.4{col 26}{space 2} 422301.4{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-450895.5{col 67}{space 3}  1211894
{txt}{space 9}RBI {c |}{col 14}{res}{space 2} 27704.49{col 26}{space 2} 23373.28{col 37}{space 1}    1.19{col 46}{space 3}0.237{col 54}{space 4}-18311.03{col 67}{space 3} 73720.02
{txt}{space 9}IBB {c |}{col 14}{res}{space 2} 290474.4{col 26}{space 2} 136985.6{col 37}{space 1}    2.12{col 46}{space 3}0.035{col 54}{space 4} 20787.57{col 67}{space 3} 560161.3
{txt}{space 10}SB {c |}{col 14}{res}{space 2}-21741.09{col 26}{space 2} 51822.84{col 37}{space 1}   -0.42{col 46}{space 3}0.675{col 54}{space 4}  -123766{col 67}{space 3} 80283.78
{txt}{space 9}AVG {c |}{col 14}{res}{space 2}-5.09e+07{col 26}{space 2} 3.89e+07{col 37}{space 1}   -1.31{col 46}{space 3}0.191{col 54}{space 4}-1.28e+08{col 67}{space 3} 2.56e+07
{txt}{space 10}BB {c |}{col 14}{res}{space 2}-1.91e+07{col 26}{space 2} 2.92e+07{col 37}{space 1}   -0.66{col 46}{space 3}0.513{col 54}{space 4}-7.66e+07{col 67}{space 3} 3.84e+07
{txt}{space 11}K {c |}{col 14}{res}{space 2}-1.41e+07{col 26}{space 2} 1.81e+07{col 37}{space 1}   -0.78{col 46}{space 3}0.436{col 54}{space 4}-4.97e+07{col 67}{space 3} 2.15e+07
{txt}{space 9}ISO {c |}{col 14}{res}{space 2} 1.05e+07{col 26}{space 2} 2.09e+07{col 37}{space 1}    0.50{col 46}{space 3}0.616{col 54}{space 4}-3.07e+07{col 67}{space 3} 5.17e+07
{txt}{space 9}WPA {c |}{col 14}{res}{space 2}  1042994{col 26}{space 2} 436712.7{col 37}{space 1}    2.39{col 46}{space 3}0.018{col 54}{space 4}   183227{col 67}{space 3}  1902761
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.50e+09{col 26}{space 2} 7.95e+08{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-4.06e+09{col 67}{space 3}-9.33e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{com}. eststo PostMoneyball

. *Comparing pre-and-post Moneyball Models

. esttab  PreMoneyball PostMoneyball,  mtitles(Pre-Moneyball Post-Moneyball) title(Comparing models pre-and-post Moneyball) nonumber star(* 0.10 ** 0.05 *** 0.01) staraux  b(3) se(3) o (_cons) scalars( "r2_a Adj R-Squared" "rmse SEE" "F F-ratio" "rss SSR") varwidth(16)
{res}
{txt}Comparing models pre-and-post Moneyball
{txt}{hline 48}
{txt}                 Pre-Money~    Post-Mone~   
{txt}{hline 48}
{txt}_cons           {res}   -1.120e+09      -2.498e+09   {txt}
                {res} {ralign 12:{txt:(}9.063e+08{txt:)}}    {ralign 12:{txt:(}7.950e+08{txt:)}}***{txt}

{txt}Year            {res}   536123.127     1236850.706   {txt}
                {res} {ralign 12:{txt:(}450791.236{txt:)}}    {ralign 12:{txt:(}395528.816{txt:)}}***{txt}

{txt}Age             {res}   186135.033      248182.736   {txt}
                {res} {ralign 12:{txt:(}316868.826{txt:)}}    {ralign 12:{txt:(}230403.648{txt:)}}   {txt}

{txt}Years           {res} 13157328.647    16289281.664   {txt}
                {res} {ralign 12:{txt:(}871156.166{txt:)}}*** {ralign 12:{txt:(}714323.604{txt:)}}***{txt}

{txt}pastWAR         {res}   625254.750      380499.377   {txt}
                {res} {ralign 12:{txt:(}483859.849{txt:)}}    {ralign 12:{txt:(}422301.411{txt:)}}   {txt}

{txt}RBI             {res}    11490.372       27704.493   {txt}
                {res} {ralign 12:{txt:(}24352.835{txt:)}}    {ralign 12:{txt:(}23373.277{txt:)}}   {txt}

{txt}IBB             {res}     -738.058      290474.415   {txt}
                {res} {ralign 12:{txt:(}154250.547{txt:)}}    {ralign 12:{txt:(}136985.615{txt:)}}** {txt}

{txt}SB              {res}   -50003.405      -21741.087   {txt}
                {res} {ralign 12:{txt:(}45479.423{txt:)}}    {ralign 12:{txt:(}51822.845{txt:)}}   {txt}

{txt}AVG             {res} 52526813.191      -5.094e+07   {txt}
                {res} {ralign 12:{txt:(}45040826.380{txt:)}}    {ralign 12:{txt:(}38896814.367{txt:)}}   {txt}

{txt}BB              {res} 35045887.109      -1.914e+07   {txt}
                {res} {ralign 12:{txt:(}32019452.544{txt:)}}    {ralign 12:{txt:(}29206472.732{txt:)}}   {txt}

{txt}K               {res} 23048917.599      -1.411e+07   {txt}
                {res} {ralign 12:{txt:(}23034118.235{txt:)}}    {ralign 12:{txt:(}18071982.721{txt:)}}   {txt}

{txt}ISO             {res} 11582644.964    10510290.494   {txt}
                {res} {ralign 12:{txt:(}24748735.400{txt:)}}    {ralign 12:{txt:(}20921725.501{txt:)}}   {txt}

{txt}WPA             {res}   275866.157     1042993.760   {txt}
                {res} {ralign 12:{txt:(}525639.544{txt:)}}    {ralign 12:{txt:(}436712.726{txt:)}}** {txt}
{txt}{hline 48}
{txt}N               {res}          234             285   {txt}
{txt}Adj R-Squared   {res}        0.769           0.838   {txt}
{txt}SEE             {res} 12112956.080    10963039.026   {txt}
{txt}F-ratio         {res}       65.669         123.019   {txt}
{txt}SSR             {res}    3.243e+16       3.269e+16   {txt}
{txt}{hline 48}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. save "/Users/allenprimack/Downloads/Untitled.dta", replace
{txt}file /Users/allenprimack/Downloads/Untitled.dta saved

{com}. 